<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Description</key>
   <string>Uses parent pkg recipe to download the latest Microsoft Edge installer package and import it into the Jamf Pro server.</string>
   <key>Identifier</key>
   <string>com.github.lchsit.lchs-recipes.jamf.MicrosoftOffice365BusinessProSuite-LCHS</string>
   <key>Input</key>
   <dict>
      	<key>NAME</key>
      	<string>Microsoft Office 365</string>
      	<key>CATEGORY</key>
   		<string>Productivity</string>
		<key>POLICY_CATEGORY</key>
		<string>@_DEPNotify_Enrollment</string>
		<key>POLICY_NAME</key>
		<string>Install Office 365</string>
		<key>POLICY_TRIGGER</key>
		<string>installOffice365</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate-NoSelfService.xml</string>
		<key>POLICY_FREQUENCY</key>
		<string>Ongoing</string>
		<key>ALL_COMPUTERS</key>
		<string>true</string>
		<key>POLICY_EXCLUDED_GROUP</key>
		<string/>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
   </dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.lchsit.lchs-recipes.pkg.MicrosoftOffice365BusinessProSuite</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>