<policy>
	<general>
		<name>%NAME%</name>
		<enabled>true</enabled>
		<trigger_checkin>false</trigger_checkin>
		<trigger_enrollment_complete>false</trigger_enrollment_complete>
		<trigger_login>false</trigger_login>
		<trigger_logout>false</trigger_logout>
		<trigger_network_state_changed>false</trigger_network_state_changed>
		<trigger_startup>false</trigger_startup>
		<trigger_other>%POLICY_TRIGGER%</trigger_other>
		<frequency>%POLCIY_FREQUENCY%</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
    <!-- Scope -->
    <scope>
        <all_computers>true</all_computers>
        <computer_groups/>
        <exclusions>YearbookEnrollment</exclusions>
    </scope>
    <!-- Packages -->
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <!-- Scripts -->
    <scripts>
        <size>0</size>
    </scripts>
    <!-- Self Service details -->
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>install</install_button_text>
        <reinstall_button_text>Reinstall</reinstall_button_text>
        <self_service_display_name>%POLICY_NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>

