<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download the latest Microsoft InTune Company Portal installer package and import it into the Jamf Pro server.</string>
      <key>Identifier</key>
      <string>com.github.lchsit.lchs-recipes.jamf.MicrosoftInTuneCompanyPortal-LCHS</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft InTune Company Portal</string>
         <key>CATEGORY</key>
         <string>Plugins and Frameworks</string>
         <key>PKG_CATEGORY</key>
         <string>%CATEGORY%</string>
      	<key>PATCH_SOFTWARETITLE_NAME</key>
         <string>Microsoft Intune Company Portal</string>
         <key>STOPPROCESSINGIF_PREDICATE</key>
         <string>download_changed == FALSE</string>
         <key>slack_webhook_url</key>
         <string>https://hooks.slack.com/services/YOUR_URL/YOUR_URL/YOUR_URL</string>
      </dict>
      <key>MinimumVersion</key>
      <string>2.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.pkg.MicrosoftIntuneCompanyPortal</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_category</key>
               <string>%PKG_CATEGORY%</string>
               <key>pkg_notes</key>
               <string>%NAME% %version% installer uploaded via AutoPkg.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
         </dict>
		   <dict>
			   <key>Arguments</key>
			   <dict>
				   <key>patch_softwaretitle</key>
				   <string>%PATCH_SOFTWARETITLE_NAME%</string>
				   <key>replace_patch</key>
				   <string>False</string>
			   </dict>
			   <key>Processor</key>
			   <string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
		   </dict>
   		<dict>
	   		<key>Processor</key>
		   	<string>com.github.grahampugh.jamf-upload.processors/JamfUploaderSlacker</string>
			   <key>Arguments</key>
		   </dict>
      </array>
   </dict>
</plist>