<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Description</key>
   <string>Uses parent pkg recipe to download the latest Microsoft Edge installer package and import it into the Jamf Pro server.</string>
   <key>Identifier</key>
   <string>com.github.lchsit.lchs-recipes.jamf.microsoftedge-LCHS</string>
   <key>Input</key>
   <dict>
      	<key>NAME</key>
      	<string>Microsoft Edge</string>
      	<key>CATEGORY</key>
   		<string>WebBrowser</string>
		<key>NAME</key>
		<string>Microsoft Edge</string>
		<key>POLICY_CATEGORY</key>
		<string>WebBrowser</string>
		<key>POLICY_NAME</key>
		<string>Microsoft Edge</string>
		<key>POLICY_TRIGGER</key>
		<string>InstallEdge</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate.xml</string>
		<key>POLICY_FREQUENCY</key>
		<string>Once Per Computer</string>
		<key>ALL_COMPUTERS</key>
		<string>true</string>
		<key>POLICY_EXCLUDED_GROUP</key>
		<string/>
		<key>PATCH_SOFTWARETITLE_NAME</key>
		<string>Microsoft Edge</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft Edge is a browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Microsoft Edge.png</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
   </dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.microsoftedge</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>patch_softwaretitle</key>
				<string>%PATCH_SOFTWARETITLE_NAME%</string>
				<key>replace_patch</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
		</dict>
	</array>
</dict>
</plist>