<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Identifier</key>
      <string>com.github.lchsit.lchs-recipes.pkg.microsoftteams2</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft Teams</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE</key>
         <string>Teams</string>
         <key>VERSIONTYPE</key>
         <string>CFBundleShortVersionString</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.microsoftteams</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
               <key>flat_pkg_path</key>
               <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack/*Teams*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               <key>pkg_payload_path</key>
               <string>%found_filename%/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload/Microsoft Teams.app</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
                <key>version_argument</key>
                <string>version</string>
            </dict>
            <key>Processor</key>
            <string>ExecutableFileVersioner</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR% %SOFTWARETITLE%-%version%.pkg</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>